import random


def weight_in():                            # User enters weight
    while True:
        wght = input("Введіть вагу: ")
        try:
            weight = float(wght)
        except ValueError:
            print("Вагу потрібно вводити числом! \nСпробуйте ще раз.\n")
        else:
            try:
                if (15 <= weight <= 300):        # Checking the correctness of variables
                    return weight
                else:
                    raise ValueError(
                        f"{weight}кг не є реалістичною вагою людини")
            except ValueError as er_ror:
                print(f"{er_ror}\nСпробуйте ще раз.\n")


def height_in():                            # User enters height
    while True:
        hght = input("Введіть ріст в см: ")
        try:
            height = float(hght)/100
        except ValueError:
            print("Ріст потрібно вводити числом! \nСпробуйте ще раз.\n")
        else:
            try:
                if (0.3 <= height <= 3):        # Checking the correctness of variables
                    return height
                else:
                    raise ValueError(
                        f"{height}м не є реалістичним ростом людини")
            except ValueError as er_ror:
                print(f"{er_ror}\nСпробуйте ще раз.\n")


def bmi_calculation(wght, hght):            # Calculation of BMI
    return wght / (hght ** 2)


def choice_set(bmi):  # user selects a training set
    while True:
        try:
            if (bmi < 18.5):
                print(
                    "\nЗа результатами ІМТ вам доступний сет тренувань для «набору ваги»")
                set = 3
            elif (bmi_value >= 18.5 and bmi_value < 25):
                set = float(
                    input("Виберіть що вас цікавить(зниження-1 підтримка-2 набір-3): "))
                # Checking the correctness of variables
                if not (set == 1 or set == 2 or set == 3):
                    raise ValueError  # ("Ви ввели не коректну команду...")
            elif (bmi_value >= 25 and bmi_value < 30):
                set = float(input(
                    "Виберіть що вас цікавить(зниження-1 підтримка-2): "))
                # Checking the correctness of variables
                if not (set == 1 or set == 2):
                    raise ValueError  # ("Ви ввели не коректну команду...")
            return set
        except ValueError:
            print("Ви ввели не коректну команду...\nСпробуйте ще раз.\n")


def switch_case_set(set):  # checking and converting the selection set
    if set == 1:
        return "зниження ваги"
    elif set == 2:
        return "підтримки ваги"
    elif set == 3:
        return "набору ваги"
    else:
        raise ValueError("Помилка з обраним сетом тренувань...")


def choice_frequency():  # choosing the frequency of training per week
    while True:
        try:
            freq = float(
                input("Оберіть кількість тренувань на тиждень\n(доступно 1,2,або 3 рази):"))
            # Checking the correctness of variables
            if (freq == 1 or freq == 2 or freq == 3):
                return freq
            else:
                raise ValueError
        except ValueError:
            print("Ви ввели не коректну команду...\nСпробуйте ще раз.\n")


def check_for_help():  # choosing the frequency of training per week
    key = float(input(
        "Натисніть '0', якщо хочете переглянути довідник, або будь-яку іншу клавішу для виходу: "))
    if (key == 0):
        return True


weight = weight_in()
height = height_in()


bmi_value = round(bmi_calculation(weight, height))          # Derivation of BMI

print(f"ІМТ = {bmi_value}")

# Analysis of BMI# Random recommendations for underweight
if (bmi_value < 18.5):
    recommendations_underweight = [
        "Ваш ІМТ є нижчим норми. Перед початком тренувань рекомендуємо звернутися до спеціаліста. Ви можете обрати план тренувань «набір ваги» і вводити у раціон більшу кількість калорій.",
        "Ваш ІМТ є заниженим. Перед початком тренувань рекомендуємо звернутися до спеціаліста для індивідуальної консультації.",
        "Ваш ІМТ є нижчим від норми. Рекомендуємо звернутися до спеціаліста для індивідуальної консультації."
    ]
    print(random.choice(recommendations_underweight))

elif (bmi_value >= 18.5 and bmi_value < 25):            # Random recommendations for normal weight
    recommendations_normal = [
        "Вітаємо, у вас ІМТ в межах норми. Ми рекомендуємо обрати наш план тренувань «підтримка ваги».",
        "Ваш ІМТ в нормі. Рекомендуємо план «підтримка ваги» для підтримки вашого стану.",
        "Вітаємо, у вас нормальний ІМТ. Ми рекомендуємо план тренувань «підтримка ваги»."
    ]
    print(random.choice(recommendations_normal))

elif (bmi_value >= 25 and bmi_value < 30):              # Recommendations for overweight
    recommendations_overweight = [
        "Ваш ІМТ є завищеним, рекомендуємо план тренувань «зниження ваги».",
        "Ваш ІМТ трохи перевищує норму. Рекомендуємо вам план тренувань «зниження ваги».",
        "Ваш ІМТ є трохи завищеним. Рекомендуємо вам план тренувань «зниження ваги»."
    ]
    print(random.choice(recommendations_overweight))

else:
    recommendations_obesity = [
        "Ваш ІМТ свідчить про ожиріння. Рекомендуємо звернутись до спеціаліста.",
        "У вас ІМТ, що вказує на ожиріння. Рекомендуємо звернутись до експерта.",
        "Ваш ІМТ свідчить про ожиріння. Рекомендуємо консультацію з дієтологом."
    ]
    print(random.choice(recommendations_obesity))


if (bmi_value < 18.5):            # we offer the user to choose a training set for: dropping, maintaining or gaining weight
    set = choice_set(bmi_value)

elif (bmi_value >= 18.5 and bmi_value < 25):
    print("За результатами ІМТ ми пропонуємо сет тренувань для «зниження ваги» «підтримки ваги» «набору ваги»")
    set = choice_set(bmi_value)

elif (bmi_value >= 25 and bmi_value < 30):
    print("За результатами ІМТ ми пропонуємо сет тренувань для «зниження ваги» або «підтримки ваги» ")
    set = choice_set(bmi_value)
else:
    # we don’t take responsibility for obese people
    print("За результатами ІМТ нажаль ми неможемо запропонувати вам сет тренувань...")
    input("\n\nЩоб завершити натисніть Enter.\n")
    raise SystemExit  # exit the program

print(f"\nОбрано сет тренувань для {switch_case_set(set)}\n")

# user chooses the number of training sessions per week
frequency = choice_frequency()

print(f"\nКористувач обрав {int(frequency)} тренування на тиждень\n")

if (bmi_value < 18.5):
    print("Сети тренувань для набору ваги:\n")

    print("Cет №1\nВипади в сторону 10 разів\nПідняття ніг 10 разів на кожну ногу\nПрисідання біля стіни 10 разів\nБіг на місці 2 хвилини\nЯгодичний міст 10 разів\nСупермен 30 секунд\nВелосипед 30 секунд\n")

    print("\nCет №2\nСтрибки з розведенням рук і ніг — 10 разів\nБіг на місці — 2 хвилини\nПрисідання біля стіни 10 разів\nПідняття ніг — 10 разів на кожну ногу\nСупермен 30 секунд\nВелосипед 30 секунд\n")

    print("\nCет №3\nБіг на місці — 2 хвилини\nБербі — 7 разів\nПрисідання біля стіни 10 разів\nАльпініст — 20 секунд\nЯгодичний міст — 15 разів\nВипади в сторону — 10 разів\nПланка — 20 секунд\n")


elif (bmi_value >= 18.5 and bmi_value < 25):
    if (set == 1):
        print("Сети тренувань для зниження ваги:\n")

        print("Cет №1\nБіг на місці — 5 хвилин\nСтрибки з розведенням рук і ніг — 15 разів\nВипади — 30 разів\nПрисідання — 30 разів\nВипади в сторону — 30 разів\nСкручування — 30 разів\nВелосипед — 2 хвилини\nПланка з ліктів — 30 секунд\nВіджимання — 15 разів\nЯгодичний міст — 30 разів\nСупермен— 1 хвилина\nПідняття ніг з ліктевої планки — 1 хвилина\nВіджимання з планки — 1 хвилина\n")

        print("\nCет №2\nБіг на місці — 5 хвилин\nБерпі — 10 разів\nПрисідання — 30 разів\nВипади — 30 разів\nВипади в сторону — 30 разів\nВелосипед — 2 хвилини\nПланка — 30 секунд\nЯгодичний міст — 30 разів\nСупермен — 1 хвилина\nСкручування — 30 разів\n")

        print("\nCет №3\nБіг на місці — 5 хвилин\nАльпініст — 30 секунд\nПідняття ніг — 30 разів на кожну ногу\nСкручування — 30 разів\nПрисідання — 20 разів\nВипади в сторону — 20 разів\nПланка — 45 секунд\nЯгодичний міст — 25 разів\nСупермен — 1 хвилина\nВелосипед — 2 хвилини\n")

    elif (set == 2):
        print("Сети тренувань для підтримки ваги:\n")

        print("Cет №1\nБіг на місці — 5 хвилин\nПрисідання — 20 раз\nЯгодичний міст — 20 раз\nПідняття ніг — 20 раз на кожну ногу\nСупермен — 1 хвилина\nСкручування — 20 раз\nВелосипед — 1 хвилина\nВіджимання — 10 раз\nПланка з ліктів — 30 секунд\nВипади — 20 раз\nВипади в сторону — 20 раз\n")

        print("\nCет №2\nБіг на місці — 5 хвилин\nСтрибки з розведенням рук і ніг — 10 раз\nЯгодичний міст — 20 раз\nПідняття ніг — 20 раз на кожну ногу\nСупермен — 1 хвилина\nПланка — 30 секунд\nВипади — 20 раз\nВипади в сторону — 20 раз\n")

        print("\nCет №3\nБіг на місці — 5 хвилин\nБерпі — 10 раз\nПрисідання — 30 раз\nАльпініст — 1 хвилина\nВіджимання — 10 раз\nСкручування — 20 раз\nВіджимання з планки — 30 секунд\nПідняття ніг з ліктевої планки — 30 секунд\nСупермен — 1 хвилина\n")

    else:
        print("Сети тренувань для набору ваги:\n")

        print("Cет №1\nБіг на місці — 5 хвилин\nСтрибки з розведенням рук і ніг — 15 разів\nВипади — 30 разів\nПрисідання — 30 разів\nВипади в сторону — 30 разів\nСкручування — 30 разів\nВелосипед — 2 хвилини\nПланка з ліктів — 30 секунд\nВіджимання — 15 разів\nЯгодичний міст — 30 разів\nСупермен— 1 хвилина\nПідняття ніг з ліктевої планки — 1 хвилина\nВіджимання з планки — 1 хвилина\n")

        print("\nCет №2\nБіг на місці — 5 хвилин\nБерпі — 10 разів\nПрисідання — 30 разів\nВипади — 30 разів\nВипади в сторону — 30 разів\nВелосипед — 2 хвилини\nПланка — 30 секунд\nЯгодичний міст — 30 разів\nСупермен — 1 хвилина\nСкручування — 30 разів\n")

        print("\nCет №3\nБіг на місці — 5 хвилин\nАльпініст — 30 секунд\nПідняття ніг — 30 разів на кожну ногу\nСкручування — 30 разів\nПрисідання — 20 разів\nВипади в сторону — 20 разів\nПланка — 45 секунд\nЯгодичний міст — 25 разів\nСупермен — 1 хвилина\nВелосипед — 2 хвилини\n")

else:
    if (set == 1):
        print("Сети тренувань для зниження ваги:\n")

        print("Cет №1\nБіг на місці — 5 хвилин\nСтрибки з розведенням рук і ніг — 20 раз\nСкручування — 35 раз\nnБербі — 15 раз\nВипади — 30 раз\nВипади в сторону — 30 раз\nАльпініст — 30 секунд\nЯгодичний міст — 35 раз\nПідняття ніг з ліктевої планки — 1 хвилина\nПланка з ліктів — 1 хвилина\nВелосипед — 2 хвилин\nВіджимання з планки — 1 хвилина\n")

        print("\nCет №2\nБіг на місці — 5 хвилин\nБербі — 15 раз\nВипади — 30 раз\nВипади в сторону — 30 раз\nСупермен — 2 хвилини\nЯгодичний міст — 35 раз\nАльпініст — 30 секунд\nВелосипед — 2 хвилини\nВіджимання — 15 раз\nСкручування — 35 раз\n")

        print("\nCет №3\nБіг на місці — 5 хвилин\nСтрибки з розведенням рук і ніг — 15 раз\nПрисідання біля стіни — 15 раз\nВипади в сторону — 20 раз\nСкручування — 35 раз\nПланка — 45 секунд\nПідняття ніг — 30 раз на кожну ногу\nЯгодичний міст — 30 раз\n")

    elif (set == 2):
        print("Сети тренувань для підтримки ваги:\n")

        print("Cет №1\nБіг на місці — 5 хвилин\nПрисідання — 20 раз\nЯгодичний міст — 20 раз\nПідняття ніг — 20 раз на кожну ногу\nСупермен — 1 хвилина\nСкручування — 20 раз\nВелосипед — 1 хвилина\nВіджимання — 10 раз\nПланка з ліктів — 30 секунд\nВипади — 20 раз\nВипади в сторону — 20 раз\n")

        print("\nCет №2\nБіг на місці — 5 хвилин\nСтрибки з розведенням рук і ніг — 10 раз\nЯгодичний міст — 20 раз\nПідняття ніг — 20 раз на кожну ногу\nСупермен — 1 хвилина\nПланка — 30 секунд\nВипади — 20 раз\nВипади в сторону — 20 раз\n")

        print("\nCет №3\nБіг на місці — 5 хвилин\nБерпі — 10 раз\nПрисідання — 30 раз\nАльпініст — 1 хвилина\nВіджимання — 10 раз\nСкручування — 20 раз\nВіджимання з планки — 30 секунд\nПідняття ніг з ліктевої планки — 30 секунд\nСупермен — 1 хвилина\n")


if check_for_help():
    print("""
    Довідник:
    1. Рекомендовані інтервали між вправами 20~30 секунд.
    2. Підтримуйте баланс води в організмі протягом дня.
    3. Дотримуйтесь частоти тренувань 1, 2 або 3 рази на тиждень.
    4. Утримуйтесь від суворих дієт.
    Пам'ятайте,що головне почати:зробити перший,маленький крок назустріч здоровому тілу і щасливому життю!
    """)

