import random


class BMIModel:
    def __init__(
        self,
        weight: float,
        height: float,
        calculated_bmi=None,
    ):
        self.weight = weight
        self.height = height / 100
        self.validate()

    def validate(self):
        if not (0 < self.height <= 3 and 0 < self.weight <= 300):
            raise ValueError("Будь ласка, введіть реалістичні значення зросту та ваги.")
        return round(self.weight / (self.height**2), 2)

    def calculate_bmi(self) -> float:
        bmi = self.weight / (self.height**2)
        self.calculated_bmi = bmi
        return round(bmi, 1)

    def bmi_category(self) -> str:
        bmi_value = self.calculate_bmi()

        if bmi_value < 18.5:
            return "Недостатня вага"
        elif 18.5 <= bmi_value <= 24.9:
            return "Нормальна вага"
        elif 25 <= bmi_value <= 29.9:
            return "Надмірна вага"
        else:
            return "Ожиріння"

    def get_recommendation(self, bmi_value):
        if bmi_value < 18.5:
            recommendations = [
                "Ваш ІМТ є нижчим норми. Перед початком тренувань рекомендуємо звернутися до спеціаліста. Ви можете обрати план тренувань «набір ваги» і вводити у раціон більшу кількість калорій.",
                "Ваш ІМТ є заниженим. Перед початком тренувань рекомендуємо звернутися до спеціаліста для індивідуальної консультації.",
                "Ваш ІМТ є нижчим від норми. Рекомендуємо звернутися до спеціаліста для індивідуальної консультації.",
            ]
        elif 18.5 <= bmi_value <= 24.9:
            recommendations = [
                "Вітаємо, у вас ІМТ в межах норми. Ми рекомендуємо обрати наш план тренувань «підтримка ваги».",
                "Ваш ІМТ в нормі. Рекомендуємо план «підтримка ваги» для підтримки вашого стану.",
                "Вітаємо, у вас нормальний ІМТ. Ми рекомендуємо план тренувань «підтримка ваги».",
            ]
        elif 25 <= bmi_value <= 29.9:
            recommendations = [
                "Ваш ІМТ є завищеним, рекомендуємо план тренувань «зниження ваги».",
                "Ваш ІМТ трохи перевищує норму. Рекомендуємо вам план тренувань «зниження ваги».",
                "Ваш ІМТ є трохи завищеним. Рекомендуємо вам план тренувань «зниження ваги».",
            ]
        else:
            recommendations = [
                "Ваш ІМТ свідчить про ожиріння. Рекомендуємо звернутись до спеціаліста та обрати план «зниження ваги».",
                "У вас ІМТ, що вказує на ожиріння. Рекомендуємо обрати план тренувань «зниження ваги».",
                "Ваш ІМТ свідчить про ожиріння. Рекомендуємо консультацію з дієтологом і план «зниження ваги».",
            ]
        return random.choice(recommendations)
